![png](Data/ERD.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'mysql@123' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
engine = create_engine(connection)

In [6]:
from urllib.parse import quote_plus as urlquote
#from sqlalchemy.engine import create_engine
connection = f'mysql+pymysql://{username}:{urlquote(password)}@localhost/Chinook'
engine = create_engine(connection)

In [7]:
connection

'mysql+pymysql://root:mysql%40123@localhost/Chinook'

In [8]:
q = '''SHOW TABLES;'''
pd.read_sql(q,engine)

   Tables_in_chinook
0              Album
1             Artist
2           Customer
3           Employee
4              Genre
5            Invoice
6        InvoiceLine
7          MediaType
8           Playlist
9      PlaylistTrack
10             Track

# What is the most a customer has spent on a single purchase and what is their customerId?

In [14]:
#q = '''SELECT customerId,MAX(Total) as m FROM Invoice GROUP BY customerID ORDER BY m DESC LIMIT 1'''
q = '''SELECT customerId,Total FROM Invoice ORDER BY Total Desc LIMIT 1'''
pd.read_sql(q,engine)

   customerId  Total
0           6  25.86

In [15]:
q = '''SELECT 
    i.CustomerId, i.Total, c.Country
FROM
    Invoice i
        JOIN
    Customer c ON c.CustomerId = i.CustomerId
ORDER BY Total DESC
LIMIT 1'''
pd.read_sql(q,engine)

   CustomerId  Total         Country
0           6  25.86  Czech Republic